[
  {
    "id": 0,
    "name": "Dock",
    "setting": "You are standing on a dock, surrounded by the fresh sea air, several boats, yachts and ferries are visible. \nYou can see an exit to a parking lot on the west and a ticket booth to the east.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Try not to walk off this dock please."
      },
      "east": {
        "value": 3
      },
      "south": {
        "value": 2
      },
      "west": {
        "value": 1
      },
      "up": {
        "value": 100,
        "message": "You're not superman, no flying into the sunset here."
      },
      "down": {
        "value": 100,
        "message": "Did you bring a jackhammer?"
      }
    }
  },
  {
    "id": 1,
    "name": "Parking Lot",
    "directions": {
      "north": {
        "value": 100,
        "message": "Where on earth are you going? Get back to your mission."
      },
      "east": {
        "value": 0
      },
      "south": {
        "value": 100,
        "message": "It would be appreciated if you got back to your mission now."
      },
      "west": {
        "value": 100,
        "message": "You have a mission to do, don't bail now."
      },
      "up": {
        "value": 100,
        "message": "Wheeeee, I'm kidding, you only made it 2 feet off the ground."
      },
      "down": {
        "value": 100,
        "message": "You fell down a drain, good job. \nYou clamber back up, looking like an idiot who watched It one too many times.",
        "hp": -5
      }
    },
    "setting": "You've made your way to one of many parking lots, surrounded by skyscrapers as far as your eyes can see, a waste of space if you ask me, nobody has the money to buy a car anymore. \nGet back to the dock on the east."
  },
  {
    "id": 2,
    "name": "McDonalds",
    "directions": {
      "north": {
        "value": 0
      },
      "east": {
        "value": 100,
        "message": "Have you never seen a wall before?"
      },
      "south": {
        "value": 100,
        "message": "Walking into the kitchen of a McDonald's isn't going to help the mission."
      },
      "west": {
        "value": 100,
        "message": "A wall, good job."
      },
      "up": {
        "value": 100,
        "message": "You checking if the paint on the ceiling is dry? I'm sure it is, get back to your mission."
      },
      "down": {
        "value": 100,
        "message": "Tiles, cool \nYou want a medal or something?"
      }
    },
    "setting": "One of the last standing McDonald's in California, is this really the time to be thinking about food though? \nGet back to your mission, they dont sell the Filet-o-fish anymore."
  },
  {
    "id": 3,
    "name": "Entry Gates",
    "directions": {
      "north": {
        "value": 4
      },
      "east": {
        "value": 100,
        "message": "Theres nothing there but water. This is not the time for a swim, get back to your mission."
      },
      "south": {
        "value": 100,
        "message": "Walking into the ocean won't help you beat Felon."
      },
      "west": {
        "value": 0
      },
      "up": {
        "value": 100,
        "message": "You can't fly, you're not a bee."
      },
      "down": {
        "value": 100,
        "message": "If you put a hole in this floor, you would get to the ocean, you would also have to pay a hefty fine."
      }
    },
    "setting": "You walk through the gates, hopefully you paid for your ticket, there's a doorway to the boats on your north."
  },
  {
    "id": 4,
    "name": "Boats",
    "directions": {
      "north": {
        "value": 100,
        "message": "Can you not tell the difference between the ground and water?"
      },
      "east": {
        "value": 5
      },
      "south": {
        "value": 3
      },
      "west": {
        "value": 100,
        "message": "Keep your feet on the ground for now."
      },
      "up": {
        "value": 100,
        "message": "Bring a jetpack next time, Barry."
      },
      "down": {
        "value": 100,
        "message": "You planning to dig to China or something?"
      }
    },
    "setting": "There are lots of boats here, You stare very intensely at the boats neatly lined up on the dock channeling your inner Jeremy Clarkson as they bob up and down in the water. \nEventually your eyes land on a particularly large yacht to the east that looks very well maintained."
  },
  {
    "id": 5,
    "name": "Loading Bay",
    "setting": "You watch as a guard loads luggage into the yacht's cargo hold to the east, there's no way you'll get onto the boat though, he's very well equipped to injure you beyond recognition.",
    "directions": {
      "north": {
        "value": 6
      },
      "east": {
        "value": 8
      },
      "south": {
        "value": 100,
        "message": "You're not going to accomplish anything by swimming away."
      },
      "west": {
        "value": 4
      },
      "up": {
        "value": 100,
        "message": "Don't waste your energy jumping, you have a mission to do."
      },
      "down": {
        "value": 100,
        "message": "This isn't the time to be socialising with ants."
      }
    }
  },
  {
    "id": 6,
    "name": "Yacht",
    "setting": "Standing next to the yacht is a bit awkward, you might make the robot guards suspicious. Hurry up and move, the front of the yacht is up north and the rear is back south.",
    "directions": {
      "north": {
        "value": 7
      },
      "east": {
        "value": 100,
        "message": "There's no door here, you can't just walk into the side of a boat."
      },
      "south": {
        "value": 5
      },
      "west": {
        "value": 100,
        "message": "Wrong way, I'm starting to think we shouldn't have recruited you."
      },
      "up": {
        "value": 100,
        "message": "Climbing up the yacht hull would be futile."
      },
      "down": {
        "value": 100,
        "message": "The floor here is made out of floor."
      }
    }
  },
  {
    "id": 7,
    "name": "Guard",
    "directions": {
      "north": {
        "value": 100,
        "message": "You can't just run away from this."
      },
      "east": {
        "value": 100,
        "message": "There's nothing there but water."
      },
      "south": {
        "value": 6
      },
      "west": {
        "value": 100,
        "message": "Walking away from someone is incredibly rude."
      },
      "up": {
        "value": 100,
        "message": "No, don't do that."
      },
      "down": {
        "value": 100,
        "message": "As flattering as that would be, worshipping a guard would be a bit suspicious."
      }
    },
    "setting": "Approaching the guard reveals that he is very nicely equipped to disable you in one swift stroke. The guard has a baton, taser, pepper spray and because he’s protecting such an important person, naturally, a gun."
  },
  {
    "id": 8,
    "name": "Cargo Hold",
    "directions": {
      "north": {
        "value": 100,
        "message": "Walking into a suitcase isn't possible, you're not that tiny."
      },
      "east": {
        "value": 100,
        "message": "A wall, cool."
      },
      "south": {
        "value": 100,
        "message": "Nice wall you've got there."
      },
      "west": {
        "value": 100,
        "message": "The ship has just left the dock, you can't leave now."
      },
      "up": {
        "value": 9
      },
      "down": {
        "value": 100,
        "message": "If you went any lower than this you'd end up in the water."
      }
    },
    "setting": "You're surrounded by what looks like years of supplies and stacks of paperwork, maybe Felon was planning to get off the grid. You hear the gentle hum of the ship's engine as it leaves the dock.\nThere is a staircase leading up."
  },
  {
    "id": 9,
    "name": "Level One Hallway",
    "setting": "You seem to have entered a rather posh looking hallway, there's a door to your east, west and south as well as another staircase leading up. You could also go down the stairs you just climbed up.",
    "directions": {
      "north": {
        "value": 100,
        "message": "You've walked into a cupboard. *disappointed sigh*"
      },
      "east": {
        "value": 12
      },
      "south": {
        "value": 10
      },
      "west": {
        "value": 11
      },
      "up": {
        "value": 13
      },
      "down": {
        "value": 8
      }
    }
  },
  {
    "id": 10,
    "name": "Engine Bay",
    "setting": "This seems to be the engine Bay, there is a single Rolls-Royce MT30 engine working as the yacht cruises along. I don't think you can do much in this room, the only major skill on your CV is professional water slide testing.",
    "directions": {
      "north": {
        "value": 9
      },
      "east": {
        "value": 100,
        "message": "Sweet wall, maybe taste it to check."
      },
      "south": {
        "value": 100,
        "message": "You're not a mechanic, you don't know how engines work."
      },
      "west": {
        "value": 100,
        "message": "You just walked into a wall, you now have a shiny new bruise."
      },
      "up": {
        "value": 100,
        "message": "Nothing above you but a ceiling."
      },
      "down": {
        "value": 100,
        "message": "Wanna fall through a floor?"
      }
    }
  },
  {
    "id": 11,
    "name": "Life Boats",
    "setting": "This room is open to the calm seas, I guess it would have to be, otherwise the lifeboats wouldn't be able to get out.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Do you want a bruise?"
      },
      "east": {
        "value": 9
      },
      "south": {
        "value": 100,
        "message":  "Don't walk into walls, you're going to break your nose."
      },
      "west": {
        "value": 100,
        "message": "Don't jump off the boat, you have work to do."
      },
      "up": {
        "value": 100,
        "message": "No, nothing there."
      },
      "down": {
        "value": 100,
        "message": "You examine a floor, it looks just like all the others on this boat."
      }
    }
  },
  {
    "id": 12,
    "name": "Weapons",
    "setting": "Finally, something exciting for you to do. Oh wait, these are all water pistols. Take one just in case I suppose.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Walking into a wall of water guns isn't going to help you."
      },
      "east": {
        "value": 100,
        "message": "Thunk, This porthole is too small for you to jump out of."
      },
      "south": {
        "value": 100,
        "message": "Walking into shelves, well that's new."
      },
      "west": {
        "value": 9
      },
      "up": {
        "value": 100,
        "message": "Up, up, and away!\n...BONK. You hit yer noggin on the ceiling.",
        "hp": -1
      },
      "down": {
        "value": 100,
        "message": "That carpet on the floor is probably musty and hasn't been cleaned in 10 years."
      }
    }
  },
  {
    "id": 13,
    "name": "Level Two Hallway",
    "setting": "Once again, you've found yourself in a nice looking hallway. There is a door on the east and west as well as another staircase to the north. You could also go down the stairs you just climbed up to the south.",
    "directions": {
      "north": {
        "value": 16
      },
      "east": {
        "value": 14
      },
      "south": {
        "value": 100,
        "message": "There's nothing there mate."
      },
      "west": {
        "value": 15
      },
      "up": {
        "value": 16
      },
      "down": {
        "value": 9
      }
    }
  },
  {
    "id": 14,
    "name": "Security",
    "setting": "You seem to have wandered into the server room. There's a set of television screens on the north wall, notably, you can see Felon Muks standing in the Main Bridge, you'll have to be careful if you go up there.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Stop walking into things, you're gonna break one of these displays."
      },
      "east": {
        "value": 100,
        "message": "Another wall, are you collecting bruises or something?"
      },
      "south": {
        "value": 100,
        "message": "You just walked into a server rack, congratulations."
      },
      "west": {
        "value": 13
      },
      "up": {
        "value": 100,
        "message": "Your noggin does not like that.",
        "hp": -1
      },
      "down": {
        "value": 100,
        "message": "You fell over. Good job.",
        "hp": -1
      }
    }
  },
  {
    "id": 15,
    "name": "Bathroom",
    "setting": "I would have expected a professional like you to have taken care of this stuff before starting the mission, but good job, you found a bathroom.",
    "directions": {
      "north": {
        "value": 100,
        "message": "There is no mirror dimension, stop."
      },
      "east": {
        "value": 13
      },
      "south": {
        "value": 100,
        "message": "Learn to walk without crashing."
      },
      "west": {
        "value": 100,
        "message": "A wall, epic."
      },
      "up": {
        "value": 100,
        "message": "No please sir no more brain damage."
      },
      "down": {
        "value": 100,
        "message": "Yuck. That would be pretty unhygienic."
      }
    }
  },
  {
    "id": 16,
    "name": "Main Bridge",
    "setting": "You walk very slowly up the stairs so you're not spotted by Muks. Thankfully, he's facing a window. You can sneak into a door to the west or a door to the east. You could also go down the stairs you just climbed up to the south.",
    "directions": {
      "north": {
        "value": 19
      },
      "east": {
        "value": 17
      },
      "south": {
        "value": 100,
        "message": "You successfully walk into a wall (again) but this time Muks hears you and you decide to make a run for it. Your extremities lock up in your immeasurable terror and you flop along to the deck like a little penguin. \nStill thinking you're a penguin, you jump overboard into the sea. \nHowever, unlike a penguin you don't know how to swim and you start to sink until -10 degree water slowly fills your lungs and you suffocate.",
        "hp": -11
      },
      "west": {
        "value": 18
      },
      "up": {
        "value": 100,
        "message": "You jump, unfortunately, because of your complete lack of educated judgement, Muks hears you. \nTurning around, the surroundings reflect in Felon's fiery red eyes as they stare you down. Muks walks to a cupboard and lifts up a The Interesting Company flamethrower. \nHe turns to face you in your last moments, his pale white skin orange in the glow of the flame that is about to snuff out your life. Oops, you're on fire.",
        "hp": -10000
      },
      "down": {
        "value": 13
      }
    }
  },
  {
    "id": 17,
    "name": "Safe",
    "setting": "Finally, you've made it. You see a small vial of magenta liquid and many bundles of cash. You're so close now, make it out alive.",
    "directions": {
      "north": {
        "value": 100,
        "message": "You're making an awful racket walking into walls all the time, you're going to give yourself away."
      },
      "east": {
        "value": 100,
        "message": "Shush, you've gotten this far, don't blow it now."
      },
      "south": {
        "value": 100,
        "message": "SHHHHHHHH!"
      },
      "west": {
        "value": 16
      },
      "up": {
        "value": 100,
        "message": "Hah. You're too short to reach that cash."
      },
      "down": {
        "value": 100,
        "message": "Nothing here but clean, shiny, expensive safe floor."
      }
    }
  },
  {
    "id": 18,
    "name": "Deck",
    "setting": "Ah, fresh air. Must be hard to come by as a field agent.",
    "directions": {
      "north": {
        "value": 100,
        "message": "There is nothing of interest over there."
      },
      "east": {
        "value": 16
      },
      "south": {
        "value": 100,
        "message": "How are you going to stop Felon Muks from here?"
      },
      "west": {
        "value": 100,
        "message": "There's nothing interesting here."
      },
      "up": {
        "value": 100,
        "message": "Up, up, and away! *splash*. Titanic flashbacks. The ocean is too cold for you.",
        "hp": -10
      },
      "down": {
        "value": 100,
        "message": "Yuck. There's bird poop on the floor."
      }
    }
  },
  {
    "id": 19,
    "name": "Controls",
    "setting": "Good job, you've disabled everyone on the ship, now you have to navigate to the specified island and hideout while the other agents deactivate the rest of Felon's guards. There's a passkey to use the control panel though, have you been paying attention?",
    "directions": {
      "north": {
        "value": 100,
        "message": "What are you going to do, jump out the window?"
      },
      "east": {
        "value": 100,
        "message": "Don't jump out the Mace Windu."
      },
      "south": {
        "value": 16
      },
      "west": {
        "value": 100,
        "message": "No, stop staring at the view and get to work."
      },
      "up": {
        "value": 100,
        "message": "Kopfschmerzen."
      },
      "down": {
        "value": 100,
        "message": "Dunce. You notice your shoelaces are untied."
      }
    }
  },
  {
    "id": 20,
    "name": "More confidential dock",
    "setting": "You're here, so close to the end of your mission. All you've got to do now is wait for the one hundred percent trustworthy associate that we've randomly selected from the California electorate roll (basically a jury yes). \n\nOh there he is. \nYou hand over the vials and money, finally you're free to go. Hold on, I lied. Get back on your boat, you parked it to your south.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Don't walk away from your associate."
      },
      "east": {
        "value": 100,
        "message": "You're so rude oh my goodness."
      },
      "south": {
        "value": 21
      },
      "west": {
        "value": 100,
        "message": "stop. walking. away."
      },
      "up": {
        "value": 100,
        "message": "Nah nothing up there."
      },
      "down": {
        "value": 100,
        "message": "Whats brown and sticky, and the thing you just stepped in?"
      }
    }
  },
  {
    "id": 21,
    "name": "The path to the magenta side",
    "setting": "You sit on the deck as the boat cruises on autocaptain. Bathed in the golden hour light, you think about the memories you've created on this mission as we insulted you non-stop. Get off the boat through the east staircase when it lands itself in a couple seconds.",
    "directions": {
      "north": {
        "value": 100,
        "message": "You're not there yet."
      },
      "east": {
        "value": 22
      },
      "south": {
        "value": 100,
        "message": "Just a little longer."
      },
      "west": {
        "value": 100,
        "message": "Just a few more hours, good job on the mission though."
      },
      "up": {
        "value": 100,
        "message": "Flying is an ability some would consider to be unnatural."
      },
      "down": {
        "value": 100,
        "message": "Good attentiveness but there isn't anything on the floor."
      }
    }
  },
  {
    "id": 22,
    "name": "Secret Island",
    "setting": "You lie on the grass feeling accomplished. Don't get too relaxed though, you haven't retired yet.",
    "directions": {
      "north": {
        "value": 100,
        "message": "Once you start down the magenta path, forever will it dominate your destiny."
      },
      "east": {
        "value": 100,
        "message": "Wherever I go, the cartridge goes."
      },
      "south": {
        "value": 100,
        "message": "The ability to save the world does not make you intelligent."
      },
      "west": {
        "value": 100,
        "message": "You did it, you brought balance to the cartridges."
      },
      "up": {
        "value": 100,
        "message": "You brought peace, freedom, justice and security to your surprisingly-not-new World."
      },
      "down": {
        "value": 100,
        "message": "Did you notice the floor was still there? Anyways you finished the game. GG. :)"
      }
    }
  }
]